# Data Cleaning Project - Passenger Traffic at Airports

The data shows top 50 world's busiest airports by passenger traffic in 2013, 2014, and 2015. It is obtained from [here ](https://data.world/datagov-uk/2ecd2a35-fc85-4cd9-b1e7-3a8f92d76fd7).

In [59]:
# import necessary libraries
import numpy as np
import pandas as pd

There are 3 different csv file for years. They needed to be combined in a table.

In [42]:
# read datasets from csv files
df_2013 = pd.read_csv('./largest-global-airports-by-passenger-traffic-2013.csv')
df_2014 = pd.read_csv('./largest-global-airports-by-passenger-traffic-2014.csv')
df_2015 = pd.read_csv('./largest-global-airports-by-passenger-traffic-2015.csv')
df_2013.head()

,Rank,Airport,Location,Code (IATA/ICAO),Total passengers,% change
0,1,Hartsfield–Jackson Atlanta International Airport,"Atlanta, Georgia, United States",ATL/KATL,"94,430,785",1%
1,2,Beijing Capital International Airport,"Chaoyang, Beijing, China",PEK/ZBAA,"83,712,355",2%
2,3,Heathrow Airport,"Hillingdon, London, United Kingdom",LHR/EGLL,"72,368,030",3%
3,4,Tokyo International Airport,"Ōta, Tokyo, Japan",HND/RJTT,"68,906,636",3%
4,5,O'Hare International Airport,"Chicago, Illinois, United States",ORD/KORD,"66,883,271",0%

When all data have combined into one table, it is important to see the year of each row in order to make an analysis.

In [43]:
# add Year column to all datasets
df_2013['Year'] = 2013
df_2014['Year'] = 2014
df_2015['Year'] = 2015

In 2013 dataset, the 'Country' column is not provided while other datasets have this column. It can be added using insert(). The name of the country will be taken from location column by using rsplit().

In [44]:
# add 'Country' column to df_2013 data ( other datasets already have that column)

# insert Country column on 3rd column index, take the last string after comma from Location
df_2013.insert(3, 'Country', df_2013['Location'].str.rsplit(',').str[-1], True) 
# leave only city name in the location column
df_2013['Location'] = df_2013['Location'].str.rsplit(',').str[1]

When we try to combine 3 files, we will see that resulting table have 2 columns for Total Passengers. The reason might be the difference on the names of columns. To see if there is any difference, we will check the names.

In [45]:
list(df_2013.columns)

['Rank',
 'Airport',
 'Location',
 'Country',
 'Code (IATA/ICAO)',
 ' Total passengers ',
 '% change',
 'Year']

In 2013 dataset, there are spaces in the column name; ' Total passengers '.

In [46]:
# delete spaces on the column name
df_2013 = df_2013.rename(columns={' Total passengers ':'Total passengers'})

Now, we can combine them.

In [47]:
# combine all datasets
df = df_2013.append([df_2014, df_2015],ignore_index=True)
df.head()

,Rank,Airport,Location,Country,Code (IATA/ICAO),Total passengers,% change,Year
0,1,Hartsfield–Jackson Atlanta International Airport,Georgia,United States,ATL/KATL,"94,430,785",1%,2013
1,2,Beijing Capital International Airport,Beijing,China,PEK/ZBAA,"83,712,355",2%,2013
2,3,Heathrow Airport,London,United Kingdom,LHR/EGLL,"72,368,030",3%,2013
3,4,Tokyo International Airport,Tokyo,Japan,HND/RJTT,"68,906,636",3%,2013
4,5,O'Hare International Airport,Illinois,United States,ORD/KORD,"66,883,271",0%,2013

In [48]:
df.shape

(150, 8)

Some of the country names such as China and US are written differently in datasets. We need to make them all same.

In [49]:
df['Country'].unique()

array([' United States', ' China', ' United Kingdom', ' Japan',
       ' United Arab Emirates', ' France', ' Indonesia', ' Germany',
       ' Singapore', ' Netherlands', ' Thailand', ' Turkey', ' Malaysia',
       ' Republic of Korea', ' Spain', ' Australia', ' India', ' Brazil',
       ' Italy', ' Canada', ' Philippines', ' Mexico', ' Russia',
       'United States', 'China', 'United Kingdom', 'Japan',
       'United Arab Emirates', 'France', 'Germany', 'Indonesia', 'Turkey',
       'The Netherlands', 'Singapore', 'Malaysia', 'Thailand',
       'Republic of Korea', 'Spain', 'Brazil', 'India', 'Australia',
       'Canada', 'Italy', 'Taiwan (Republic of China)', 'Mexico',
       'Philippines', 'Russia', 'USA',
       "China (People's Republic of China)", 'Hong Kong, China',
       'Netherlands', 'Korea (Rep of Korea)', 'Chinese Taipei'],
      dtype=object)

In [50]:
df['Country'] = df['Country'].str.strip()
df = df.replace(to_replace="China (People's Republic of China)", value='China')
df = df.replace(to_replace=' United States', value='USA')
df = df.replace(to_replace='United States', value='USA')

In [51]:
df['Country'].unique()

array(['USA', 'China', 'United Kingdom', 'Japan', 'United Arab Emirates',
       'France', 'Indonesia', 'Germany', 'Singapore', 'Netherlands',
       'Thailand', 'Turkey', 'Malaysia', 'Republic of Korea', 'Spain',
       'Australia', 'India', 'Brazil', 'Italy', 'Canada', 'Philippines',
       'Mexico', 'Russia', 'The Netherlands',
       'Taiwan (Republic of China)', 'Hong Kong, China',
       'Korea (Rep of Korea)', 'Chinese Taipei'], dtype=object)

In [52]:
df.head(70)

,Rank,Airport,Location,Country,Code (IATA/ICAO),Total passengers,% change,Year
0,1,Hartsfield–Jackson Atlanta International Airport,Georgia,USA,ATL/KATL,"94,430,785",1%,2013
1,2,Beijing Capital International Airport,Beijing,China,PEK/ZBAA,"83,712,355",2%,2013
2,3,Heathrow Airport,London,United Kingdom,LHR/EGLL,"72,368,030",3%,2013
3,4,Tokyo International Airport,Tokyo,Japan,HND/RJTT,"68,906,636",3%,2013
4,5,O'Hare International Airport,Illinois,USA,ORD/KORD,"66,883,271",0%,2013
...,...,...,...,...,...,...,...,...
65,16,Singapore Changi Airport,Changi,Singapore,SIN/WSSS,"54,091,802",0.7%,2014
66,17,John F. Kennedy International Airport,"Queens, New York City, New York",USA,JFK/KJFK,"53,635,346",6.4%,2014
67,18,Denver International Airport,"Denver, Colorado",USA,DEN/KDEN,"53,472,514",1.7%,2014
68,19,Shanghai Pudong International Airport,"Pudong, Shanghai",China,PVG/ZSPD,"51,651,800",9.5%,2014
69,20,Kuala Lumpur International Airport,"Sepang, Selangor",Malaysia,KUL/WMKK,"48,932,471",3.0%,2014

Check the types of data in each column. Total passengers column should be numeric. First, we need to remove commas then change data type.

In [53]:
df.dtypes

Rank                 int64
Airport             object
Location            object
Country             object
Code (IATA/ICAO)    object
Total passengers    object
% change            object
Year                 int64
dtype: object

In [54]:
df['Total passengers']=df['Total passengers'].str.replace(',','')
df['Total passengers']=df['Total passengers'].astype(int)
df.dtypes

Rank                 int64
Airport             object
Location            object
Country             object
Code (IATA/ICAO)    object
Total passengers     int64
% change            object
Year                 int64
dtype: object

Lastly, check for null cells.

In [55]:
df.isnull().values.any()

False

### Analysis of Data

In [58]:
df_2 = df.groupby(['Year','Country'])['Rank'].count().reset_index()
df_2

    Year               Country  Rank
0   2013             Australia     1
1   2013                Brazil     1
2   2013                Canada     1
3   2013                 China     7
4   2013                France     1
..   ...                   ...   ...
66  2015              Thailand     1
67  2015                Turkey     1
68  2015                   USA    16
69  2015  United Arab Emirates     1
70  2015        United Kingdom     2

[71 rows x 3 columns]